FreeRTOS/Lab-Project-FreeRTOS-FAT/portable/STM32F7xx/ff_sddisk.c
    vGPIO_SD_Init( &xSDHandle );

    #if ( SDIO_USES_DMA != 0 )
    {
        prvSDIO_DMA_Init();
    }
    #endif

    int SD_state = SD_OK;

    /* Check if the SD card is plugged in the slot */
    if( prvSDDetect() == pdFALSE )
    {
        FF_PRINTF( "No SD card detected\n" );
        return pdFAIL;
    }

    /* When starting up, skip debouncing of the Card Detect signal. */
    xCardDetect.bLastPresent = pdTRUE;
    xCardDetect.bStableSignal = pdTRUE;
    /* Initialise the SDIO device and read the card parameters. */
    SD_state = HAL_SD_Init( &xSDHandle, &xSDCardInfo );
    #if ( BUS_4BITS != 0 )
    {
        if( SD_state == SD_OK )
        {
            HAL_SD_ErrorTypedef rc;

            xSDHandle.Init.BusWide = SDIO_BUS_WIDE_4B;
            rc = HAL_SD_WideBusOperation_Config( &xSDHandle, SDIO_BUS_WIDE_4B );

            if( rc != SD_OK )
            {
                FF_PRINTF( "HAL_SD_WideBus: %d: %s\n", rc, prvSDCodePrintable( ( uint32_t ) rc ) );
            }
        }
    }
    #endif /* if ( BUS_4BITS != 0 ) */
    FF_PRINTF( "HAL_SD_Init: %d: %s type: %s Capacity: %u MB\n",
               SD_state, prvSDCodePrintable( ( uint32_t ) SD_state ),
               xSDHandle.CardType == HIGH_CAPACITY_SD_CARD ? "SDHC" : "SD",
               ( unsigned ) ( xSDCardInfo.CardCapacity / ( 1024 * 1024 ) ) );

    return ( SD_state == SD_OK ) ? pdPASS : pdFAIL;
}
/*-----------------------------------------------------------*/

struct xCODE_NAME
{
    uint32_t ulValue;
    const char * pcName;
};

const struct xCODE_NAME xSD_CODES[] =
{
    { SD_CMD_CRC_FAIL,           "CMD_CRC_FAIL: Command response received (but CRC check failed)"                                                                         },
    { SD_DATA_CRC_FAIL,          "DATA_CRC_FAIL: Data block sent/received (CRC check failed)"                                                                             },
    { SD_CMD_RSP_TIMEOUT,        "CMD_RSP_TIMEOUT: Command response timeout"                                                                                              },
    { SD_DATA_TIMEOUT,           "DATA_TIMEOUT: Data timeout"                                                                                                             },
    { SD_TX_UNDERRUN,            "TX_UNDERRUN: Transmit FIFO underrun"                                                                                                    },
    { SD_RX_OVERRUN,             "RX_OVERRUN: Receive FIFO overrun"                                                                                                       },
    { SD_START_BIT_ERR,          "START_BIT_ERR: Start bit not detected on all data signals in wide bus mode"                                                             },
    { SD_CMD_OUT_OF_RANGE,       "CMD_OUT_OF_RANGE: Command's argument was out of range"                                                                                  },
    { SD_ADDR_MISALIGNED,        "ADDR_MISALIGNED: Misaligned address"                                                                                                    },
    { SD_BLOCK_LEN_ERR,          "BLOCK_LEN_ERR: Transferred block length is not allowed for the card or the number of transferred bytes does not match the block length" },
    { SD_ERASE_SEQ_ERR,          "ERASE_SEQ_ERR: An error in the sequence of erase command occurs."                                                                       },
    { SD_BAD_ERASE_PARAM,        "BAD_ERASE_PARAM: An invalid selection for erase groups"                                                                                 },
    { SD_WRITE_PROT_VIOLATION,   "WRITE_PROT_VIOLATION: Attempt to program a write protect block"                                                                         },
    { SD_LOCK_UNLOCK_FAILED,     "LOCK_UNLOCK_FAILED: Sequence or password error has been detected in unlock command or if there was an attempt to access a locked card"  },
    { SD_COM_CRC_FAILED,         "COM_CRC_FAILED: CRC check of the previous command failed"                                                                               },
    { SD_ILLEGAL_CMD,            "ILLEGAL_CMD: Command is not legal for the card state"                                                                                   },
    { SD_CARD_ECC_FAILED,        "CARD_ECC_FAILED: Card internal ECC was applied but failed to correct the data"                                                          },
    { SD_CC_ERROR,               "CC_ERROR: Internal card controller error"                                                                                               },
    { SD_GENERAL_UNKNOWN_ERROR,  "GENERAL_UNKNOWN_ERROR: General or unknown error"                                                                                        },
    { SD_STREAM_READ_UNDERRUN,   "STREAM_READ_UNDERRUN: The card could not sustain data transfer in stream read operation"                                                },
    { SD_STREAM_WRITE_OVERRUN,   "STREAM_WRITE_OVERRUN: The card could not sustain data programming in stream mode"                                                       },
    { SD_CID_CSD_OVERWRITE,      "CID_CSD_OVERWRITE: CID/CSD overwrite error"                                                                                             },
    { SD_WP_ERASE_SKIP,          "WP_ERASE_SKIP: Only partial address space was erased"                                                                                   },
    { SD_CARD_ECC_DISABLED,      "CARD_ECC_DISABLED: Command has been executed without using internal ECC"                                                                },
    { SD_ERASE_RESET,            "ERASE_RESET: Erase sequence was cleared before executing because an out of erase sequence command was received"                         },
    { SD_AKE_SEQ_ERROR,          "AKE_SEQ_ERROR: Error in sequence of authentication"                                                                                     },
    { SD_INVALID_VOLTRANGE,      "INVALID_VOLTRANGE"                                                                                                                      },
    { SD_ADDR_OUT_OF_RANGE,      "ADDR_OUT_OF_RANGE"                                                                                                                      },
    { SD_SWITCH_ERROR,           "SWITCH_ERROR"                                                                                                                           },
    { SD_SDIO_DISABLED,          "SDIO_DISABLED"                                                                                                                          },
    { SD_SDIO_FUNCTION_BUSY,     "SDIO_FUNCTION_BUSY"                                                                                                                     },
    { SD_SDIO_FUNCTION_FAILED,   "SDIO_FUNCTION_FAILED"                                                                                                                   },
    { SD_SDIO_UNKNOWN_FUNCTION,  "SDIO_UNKNOWN_FUNCTION"                                                                                                                  },

    /**
     * @brief  Standard error defines
     */
    { SD_INTERNAL_ERROR,         "INTERNAL_ERROR"                                                                                                                         },
    { SD_NOT_CONFIGURED,         "NOT_CONFIGURED"                                                                                                                         },
    { SD_REQUEST_PENDING,        "REQUEST_PENDING"                                                                                                                        },
    { SD_REQUEST_NOT_APPLICABLE, "REQUEST_NOT_APPLICABLE"                                                                                                                 },
    { SD_INVALID_PARAMETER,      "INVALID_PARAMETER"                                                                                                                      },
    { SD_UNSUPPORTED_FEATURE,    "UNSUPPORTED_FEATURE"                                                                                                                    },
    { SD_UNSUPPORTED_HW,         "UNSUPPORTED_HW"                                                                                                                         },
    { SD_ERROR,                  "ERROR"                                                                                                                                  },
    { SD_OK,                     "OK"                                                                                                                                     },
};
/*-----------------------------------------------------------*/

